Revit 2027 API
HostedSweep.GetEndPointParameter Method
Retrieve segment's start point or end point parameter.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double GetEndPointParameter(
	Reference targetRef,
	int endIdx
)
Public Function GetEndPointParameter (
	targetRef As Reference,
	endIdx As Integer
) As Double
public:
double GetEndPointParameter(
	Reference^ targetRef,
	int endIdx
)
member GetEndPointParameter :
        targetRef : Reference *
        endIdx : int -> float
Parameters
targetRef Reference
Segment's reference whose parameter want to be get.
endIdx Int32
Start point (=0) or end point (=1).
Return Value
Double
Start point or end point parameter.
Exceptions
Exception | Condition
InvalidOperationException | Thrown when regeneration fails.
See Also
Reference
HostedSweep Class
Autodesk.Revit.DB Namespace